app1/scripts/load-test.yml
config:
  target: "https://8u0xag1lqh.execute-api.us-east-1.amazonaws.com/prod/"
  phases:
    - duration: 60
      arrivalRate: 5
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    expect:
      reportFailuresAsErrors: false
      outputFormat: silent
    metrics-by-endpoint: 
      useOnlyRequestNames: true
  processor: "../../processors/processor.js"

  payload:
    path: "../data/clean_ids.csv"

  variables:
    resetPointer: true
    sourceFile: "app1/data/clean_ids.csv"  # The file to read
    targetVar: "productId"       # The variable name to use in {{ }}
    recycleData: false  # Set to false to abort when IDs run out

  # --- ADDED PAYLOAD MODULE ---
  # payload:
  #   path: "clean_ids.csv"
  #   fields:
  #     - "name"
  #   order: "random" # or "random"

  ensure:
    p95: 10000
    maxErrorRate: 20
    # thresholds:
    #     # p99 of response time must be <250:
    #     - 'http.response_time.p99': 250
    #     # p95 of response time must be <100:
    #     - 'http.response_time.p95': 100
    # conditions:
    #   # This expression now sums both 200 and 201 codes to check against the 1% error threshold
    #   - expression: "coalesce(http.codes.200, 0) + coalesce(http.codes.201, 0) >= http.requests * 0.99"
    #     strict: true

  
scenarios:
  - flow:
      # - log: "ProductName: {{name}}"

      - function: "pullFromPool"
      # This matches 'targetVar' above
      - log: "Requesting: /products/{{ productId }}"
      
      # GET request with random query params
      - function: "randomGet"

      - get:
          name: "GET_Test"
          url: "/test?name={{ name }}&address={{ address }}"
          expect:
            - statusCode: 200
          afterResponse: 
            - "logError"
            - "captureMetrics"
          capture:
            json: "$"
            as: "response"
          log : "{{response}}"
      
      # POST request with random body
      - function: "randomPost"
      # - log: "{{postData.name}} {{postData.name}}"
      - post:
          name: "POST_Test"
          url: "/test"
          afterResponse: 
            - "logError"
            - "captureMetrics"
          json:
            name: "{{ postData.name }}"
            address: "{{ postData.address }}"
          # Expectation checks
          expect:
              - statusCode: 200